{
  "intro": {
    "eyebrow": "Timeline",
    "title": "Experience",
    "subtitle": "Impact-focused roles across startups and enterprise."
  },
  "items": [
    {
      "role": "Software Engineer",
      "company": "Pfizer",
      "location": "Thessaloniki, Greece",
      "start": "2024-09",
      "end": "2025-09",
      "highlights": [
        { "label": "Incidents", "value": "-30%" },
        { "label": "p95 Latency", "value": "<300ms" },
        { "label": "Defects Resolved", "value": "15+" }
      ],
      "bullets": [
        "Developed and maintained software solutions using PHP (Laravel) and JavaScript (VueJS) ensuring robust performance and scalability.",
        "Diagnosed and resolved critical bugs in production level applications, enhancing system reliability and user experience.",
        "Acted as the Subject Matter Expert for complex web applications, delivering in-depth technical analysis, conducting code reviews and mentoring other team members within the application environment",
        "Collaborated with cross-functional teams to design and implement innovative software solutions tailored to organizational needs.",
        "Contributed to architectural decisions for scalable web applications, ensuring modular design and alignment with enterprise-level performance."
      ],
      "tech": ["Laravel", "Vue.js", "MySQL", "Docker", "AWS"]
    },
    {
      "role": "Full-stack Developer",
      "company": "Ontovisual IKE",
      "location": "Ioannina, Greece",
      "start": "2023-02",
      "end": "2024-07",
      "highlights": [
        { "label": "APIs", "value": "Full REST" },
        { "label": "3D Scenes", "value": "R3F" },
        { "label": "Dashboards", "value": "Realtime" }
      ],
      "bullets": [
        "Developed comprehensive Full-REST-APIs using Node.js and Strapi, seamlessly integrating with both SQL and NoSQL databases.",
        "Designed and developed web applications for cultural institutions, leveraging React and React-Three-Fiber to create immersive experiences featuring advanced 3D graphics and modern web development techniques.",
        "Utilized React and its associated libraries alongside PostgreSQL to implement real-time data visualization from sensor metrics, significantly enhancing user engagement and functionality."
      ],
      "tech": ["Node.js", "Strapi", "React", "R3F", "PostgreSQL"],
      "links": []
    },
    {
      "role": "Full-stack Developer",
      "company": "Terracom",
      "location": "Ioannina, Greece",
      "start": "2022-07",
      "end": "2022-08",
      "highlights": [],
      "bullets": [
        "Contributed to production web features and gained hands-on experience."
      ],
      "tech": ["React", "Node.js", "HTML", "CSS"],
      "links": []
    }
  ]
}
